export const HEADER_TEXT = {
  title: 'С заботой о каждом, с энергией для всех!',
  headerImage: 'images/logo.png',
  navItems: [
    {
      href: '/#home',
      title: 'О компании',
    },
    {
      href: '/#services',
      title: 'Услуги',
    },
    {
      href: '/#about',
      title: 'Пресс-центр',
    },
    {
      href: '/#contact',
      title: 'Контакты',
    },
  ],
};

export const ABOUT_TEXT = {
  title: 'Общая информация',
  description: (
    <>
      АО «Сетевая компания» Республики Татарстан создано по решению Кабинета
      Министров Республики Татарстан
      <br /> 11 декабря 2001 года в соответствии с планами реформирования
      энергетики на базе 9 предприятий электрических сетей,
      <br /> которые в настоящее время являются его филиалами.
    </>
  ),
  videoTitle: 'Видео',
  videoUrl: 'https://www.youtube.com/embed/yzq5lFqXnmo',
  infoTitle: 'Сведения',
  info: (
    <>
      По величине передаваемой мощности компания входит в десятку самых крупных
      электросетевых компаний России. Компания занимает лидирующие позиции по
      сравнению с прочими территориальными сетевыми компаниями, входящими в
      составы МРСК, по показателю общей протяженности эксплуатируемых воздушных
      и кабельных линий, а также по количеству подстанций, трансформаторных
      подстанций и распределительных пунктов. Кроме того,
      <br />
      Компания является единственной в России территориальной сетевой
      организацией, которой принадлежат объекты электросетевого хозяйства
      уровней напряжения от 0,4 кВ до 500 кВ.
    </>
  ),
};

export const CONTACT_US_TEXT = {
  info: [
    {
      title: 'Наш адрес',
      value:
        'АО "Сетевая компания",Россия Республика Татарстан. 420094, г. Казань, ул. Бондаренко, д.3',
    },
    {
      title: 'Контакты',
      value: '8 800 2000 878',
    },
    {
      title: 'EMAIL',
      value: 'office@gridcom-rt.ru',
    },
  ],
  form: {
    firstname: 'Имя',
    email: 'Email',
    subject: 'Тема письма',
    message: 'Сообщение',
    send: 'Отправить',
  },
};

export const FEATURES_TEXT = {
  title: 'Наши направления',
  subtitle: 'Основными видами экономической деятельности являются:',
  mainImgUrl: 'images/main-feature.png',
  features: [
    {
      icon: 'fa-download',
      title: 'Электрическая энергия',
      description: 'Оказание услуг по передаче электрической энергии.',
    },
    {
      icon: 'fa-database',
      title: 'Присоединения потребителей',
      description:
        'Оказание услуг по технологическому присоединению потребителей.',
    },
  ],
};

export const FOOTER_TEXT = {
  text: 'Алимова Ксения.',
};

export const NUMBERS_TEXT = {
  title: 'На 01.01.2021 в филиалах АО «Сетевая компания» на балансе находится',
  numbers: [
    {
      title: 'подстанции 35-500 кВ',
      value: 384,
      delay: '0ms',
    },
    {
      title: 'силовых трансформаторов 3-500 кВ',
      value: 761,
      delay: '100ms',
    },
    {
      title: 'Общая протяженность воздушных линий 35-500 кВ',
      value: '10466,2 км',
      delay: '200ms',
    },
    {
      title: 'Общая протяженность по линиям',
      value: '12988,2 км',
      delay: '300ms',
    },
  ],
};

export const SERVICES_TEXT = {
  title: 'Услуги',
  links: [
    {
      link: '/meters',
      img: 'img/proektirovanie.png',
      label: 'Приборы учета электроэнергии. Продажа и обслуживание',
    },
    {
      link: '/proektirovanie-inzhenernyh-sistem',
      img: 'img/proektirovanie.png',
      label: 'Проектирование инженерных систем',
    },
    {
      link: '/sale',
      img: 'img/proektirovanie.png',
      label: 'Продажа электротехнической продукции',
    },
    {
      link: '/cantekhnicheskie-raboty',
      img: 'img/proektirovanie.png',
      label: 'Сантехнические работы',
    },
    {
      link: '/gidrolock',
      img: 'img/proektirovanie.png',
      label: 'Установка системы защиты от протечек воды',
    },
    {
      link: '/water',
      img: 'img/proektirovanie.png',
      label: 'Установка и обслуживание приборов учета расхода воды',
    },
    {
      link: '/connection',
      img: 'img/proektirovanie.png',
      label: 'Подключение к электроснабжению под ключ',
    },
    {
      link: '/wiring',
      img: 'img/proektirovanie.png',
      label: 'Электромонтажные работы',
    },
    {
      link: '/backup',
      img: 'img/proektirovanie.png',
      label: 'Организация резервного энергоснабжения',
    },
    {
      link: '/molniezashchita',
      img: 'img/proektirovanie.png',
      label: 'Молниезащита',
    },
    {
      link: '/solarplant',
      img: 'img/proektirovanie.png',
      label: 'Солнечные электростанции',
    },
    {
      link: '/payments-extra',
      img: 'img/proektirovanie.png',
      label: 'Способы оплаты дополнительных услуг',
    },
    {
      link: '/internet-tv',
      img: 'img/proektirovanie.png',
      label: 'Интернет и цифровое ТВ',
    },
    { link: '/pricelist', img: 'img/proektirovanie.png', label: 'Прейскурант' },
  ],
};

export const TEAM_TEXT = {
  title: 'Руководство компании',
  members: [
    {
      imgUrl: 'images/team/01.jpg',
      fullname: 'Фардиев Ильшат Шаехович',
      position: 'Генеральный директор',
      delay: '0ms',
    },
    {
      imgUrl: 'images/team/02.jpg',
      fullname: 'Галимзянов Илшат Рифкатович',
      position: 'Заместитель Генерального директора - технический директор',
      delay: '100ms',
    },
    {
      imgUrl: 'images/team/03.jpg',
      fullname: 'Бомонина Нина Александровна',
      position: 'Заместитель Генерального директора по финансам',
      delay: '200ms',
    },
    {
      imgUrl: 'images/team/04.jpg',
      fullname: 'Назарова Наталья Александровна',
      position:
        'Заместитель Генерального директора - директор по экономике и реализации услуг',
      delay: '300ms',
    },
  ],
};

/*
  title
  description
  linksWithImages
  paragraphs
*/
export const INNER_PAGES_CONTENT = {
  meters: {
    title: 'Подключение к электроснабжению "под ключ"',
    description: 'Платите за свет меньше',
    linksWithImages: [
      {
        href: '#',
        title: 'Продажа приборов учета электроэнергии',
      },
      {
        href: '#',
        title: 'Графики бесплатной замены',
      },
      {
        href: '#',
        title: 'Установка/замена',
      },
    ],
    paragraphs: [
      {
        text: 'Правильный учёт энергии - это основа жизнедеятельности любой энергосистемы. Рынок электрических приборов предлагает различные модели, поэтому необходимо точно определить требуемые класс точности и способ установки.',
        type: 'p',
      },
      {
        text: 'Счетчики классифицируются по типам измеряемых величин (однофазные и трехфазные), способам подключения (приборы прямого включения в цепь и трансформаторного) и типам конструкции (индукционные и электронные).',
        type: 'p',
      },
      {
        text: 'Мы уделяем большое внимание вопросам внедрения самых современных систем учёта и обеспечению высокой точности их работы и имеем многолетний опыт сотрудничества с такими крупными производителями приборов и систем учета как: ООО "Матрица", ООО НПК "Инкотекс", ОАО "Каскад", ЗАО "Энергомера" и другие.',
        type: 'p',
      },
    ],
  },
  'proektirovanie-inzhenernyh-sistem': {
    title: 'Проектирование инженерных систем',
    linksWithImages: [
      {
        href: '#',
        title: 'Проект электроснабжения',
      },
      {
        href: '#',
        title: 'Проект водоснабжения и канализации',
      },
      {
        href: '#',
        title: 'Проект отопления',
      },
      {
        href: '#',
        title: 'Проект вентиляции и кондиционирования',
      },
      {
        href: '#',
        title: 'Проект слаботочных сетей (видеонаблюдение, сигнализация)',
      },
    ],
  },
  sale: {
    title: 'Продажа электротехнической продукции',
    paragraphs: [
      {
        text: 'АО «Мосэнергосбыт» предлагает широкий ассортимент современного электротехнического оборудования, изделий и услуг для электромонтажа.',
        type: 'p',
      },
      {
        text: 'Вся поставляемая продукция – это сертифицированное оборудование от ведущих производителей. АО «Мосэнергосбыт» предлагает качественную электротехническую продукцию, ведь это важный элемент надёжной и безопасной работы.',
        type: 'p',
      },
    ],
  },
  'cantekhnicheskie-raboty': {
    title: 'Сантехнические работы',
    description: 'Сантехнические работы качественно и оперативно!',
    paragraphs: [
      {
        type: 'p',
        text: 'АО «Мосэнергосбыт»  предлагает услуги по проведению профессиональных сантехнических работ в многоквартирных жилых домах и частном секторе.',
      },
      {
        type: 'p',
        text: 'Производятся сантехнические работы любой сложности от монтажа горячего и холодного водоснабжения до подключения бытовой техники:',
      },
      {
        type: 'li',
        text: 'Установка и замена сантехнического оборудования (смесителя, полотенцесушителя, ванны и др.)',
      },
      {
        type: 'li',
        text: 'Замена труб водоснабжения, водоотведения и отопления',
      },
      {
        type: 'li',
        text: 'Установка системы защиты от протечек воды GIDROLOCK',
      },
      {
        type: 'p',
        text: 'Заказав выполнение работ по установке и замене сантехнического оборудования вы можете быть уверены в оперативности и высоком качестве выполнения работ. На все работы предоставляется гарантия в течение 2 лет.',
      },
      {
        type: 'p',
        text: 'Для уточнения информации и заказа услуги вы можете оставить заявку на сайте или позвонить в Единый Контактный Центр по телефону: +7 (499) 550-33-77.',
      },
      {
        type: 'p',
        text: 'Работы выполняются с привлечением подрядной организации.',
      },
    ],
  },
  gidrolock: {},
  water: {},
  connection: {},
  wiring: {},
  backup: {},
  molniezashchita: {},
  solarplant: {},
  'payments-extra': {},
  'internet-tv': {},
  pricelist: {},
};

// todo move to .env
export const MAIL = {
  SERVICE_ID: 'service_knj9uue',
  TEMPLATE_ID: 'template_jmv7bzq',
  PUBLIC_KEY: 'G1z9z42lxd3e0C-SZ',
};
